In [1]:
import pandas as pd
df=pd.read_csv('Social_Network_Ads.csv')
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [3]:
df=pd.read_csv('Social_Network_Ads.csv', index_col=[0])
df.head()

          Gender  Age  EstimatedSalary  Purchased
User ID
15624510    Male   19            19000          0
15810944    Male   35            20000          0
15668575  Female   26            43000          0
15603246  Female   27            57000          0
15804002    Male   19            76000          0

In [5]:
df.tail()

          Gender  Age  EstimatedSalary  Purchased
User ID
15691863  Female   46            41000          1
15706071    Male   51            23000          1
15654296  Female   50            20000          1
15755018    Male   36            33000          0
15594041  Female   49            36000          1

In [7]:
df.head

<bound method NDFrame.head of           Gender  Age  EstimatedSalary  Purchased
User ID
15624510    Male   19            19000          0
15810944    Male   35            20000          0
15668575  Female   26            43000          0
15603246  Female   27            57000          0
15804002    Male   19            76000          0
...          ...  ...              ...        ...
15691863  Female   46            41000          1
15706071    Male   51            23000          1
15654296  Female   50            20000          1
15755018    Male   36            33000          0
15594041  Female   49            36000          1

[400 rows x 4 columns]>

In [9]:
df.describe()

              Age  EstimatedSalary   Purchased
count  400.000000       400.000000  400.000000
mean    37.655000     69742.500000    0.357500
std     10.482877     34096.960282    0.479864
min     18.000000     15000.000000    0.000000
25%     29.750000     43000.000000    0.000000
50%     37.000000     70000.000000    0.000000
75%     46.000000     88000.000000    1.000000
max     60.000000    150000.000000    1.000000

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 400 entries, 15624510 to 15594041
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Gender           400 non-null    object
 1   Age              400 non-null    int64
 2   EstimatedSalary  400 non-null    int64
 3   Purchased        400 non-null    int64
dtypes: int64(3), object(1)
memory usage: 15.6+ KB

In [13]:
df.shape

(400, 4)

In [15]:
df.columns

Index(['Gender', 'Age', 'EstimatedSalary', 'Purchased'], dtype='object')

In [9]:
df.isnull()

          Gender    Age  EstimatedSalary  Purchased
User ID
15624510   False  False            False      False
15810944   False  False            False      False
15668575   False  False            False      False
15603246   False  False            False      False
15804002   False  False            False      False
...          ...    ...              ...        ...
15691863   False  False            False      False
15706071   False  False            False      False
15654296   False  False            False      False
15755018   False  False            False      False
15594041   False  False            False      False

[400 rows x 4 columns]

In [17]:
df.isnull().sum()

Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

## dropna() method

In [19]:
df1=df.copy()
df1.isnull().sum()

Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [12]:
df1.shape

(400, 4)

## Replacing missing values

In [21]:
df2=df.copy()
df2.isnull().sum()

Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [23]:
df2.head()

          Gender  Age  EstimatedSalary  Purchased
User ID
15624510    Male   19            19000          0
15810944    Male   35            20000          0
15668575  Female   26            43000          0
15603246  Female   27            57000          0
15804002    Male   19            76000          0

In [25]:
df2["Gender"].fillna("Male")
df2.isnull().sum()

Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [27]:
df2["EstimatedSalary"].fillna(df2["EstimatedSalary"].median())
df2["Age"].fillna(df2["Age"].mean())
df2.isnull().sum()

Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

## Dealing with duplicate data

In [29]:
df2=df2.drop_duplicates()
df2.shape

(380, 4)

## .loc[] and .iloc[]

In [31]:
print(df2.iloc[0])

Gender              Male
Age                   19
EstimatedSalary    19000
Purchased              0
Name: 15624510, dtype: object

In [33]:
print(df2.loc[:,'Gender'])

User ID
15624510      Male
15810944      Male
15668575    Female
15603246    Female
15804002      Male
             ...
15691863    Female
15706071      Male
15654296    Female
15755018      Male
15594041    Female
Name: Gender, Length: 380, dtype: object

In [35]:
df_usingiloc=df2.iloc[1:5,2:5]  
df_usingiloc.shape

(4, 2)

In [37]:
df_usingloc= df2.loc[(df2.Gender=='Female') & (df2.EstimatedSalary < 25000.0)]
df_usingloc.head()

          Gender  Age  EstimatedSalary  Purchased
User ID
15599081  Female   45            22000          1
15573452  Female   21            16000          0
15764419  Female   27            17000          0
15671655  Female   35            23000          0
15595228  Female   20            23000          0

## Dropping colums

In [39]:
df3=df.copy()
df3.head()

          Gender  Age  EstimatedSalary  Purchased
User ID
15624510    Male   19            19000          0
15810944    Male   35            20000          0
15668575  Female   26            43000          0
15603246  Female   27            57000          0
15804002    Male   19            76000          0

In [41]:
df3=df3.drop('Gender',axis=1)   
df3.head()

          Age  EstimatedSalary  Purchased
User ID
15624510   19            19000          0
15810944   35            20000          0
15668575   26            43000          0
15603246   27            57000          0
15804002   19            76000          0

In [43]:
df3=df3.drop([15810944,15668575],axis=0)
df3.head()

          Age  EstimatedSalary  Purchased
User ID
15624510   19            19000          0
15603246   27            57000          0
15804002   19            76000          0
15728773   27            58000          0
15598044   27            84000          0

## Renaming a column in dataset

In [45]:
df3.columns

Index(['Age', 'EstimatedSalary', 'Purchased'], dtype='object')

In [55]:
df3.rename(columns={'EstimatedSalary':'Salary'},inplace= True)
df3.head(25)

          Age  Salary  Purchased
User ID
15624510   19   19000          0
15603246   27   57000          0
15804002   19   76000          0
15728773   27   58000          0
15598044   27   84000          0
15694829   32  150000          1
15600575   25   33000          0
15727311   35   65000          0
15570769   26   80000          0
15606274   26   52000          0
15746139   20   86000          0
15704987   32   18000          0
15628972   18   82000          0
15697686   29   80000          0
15733883   47   25000          1
15617482   45   26000          1
15704583   46   28000          1
15621083   48   29000          1
15649487   45   22000          1
15736760   47   49000          1
15714658   48   41000          1
15599081   45   22000          1
15705113   46   23000          1
15631159   47   20000          1
15792818   49   28000          1

## Group by in DataFrame

In [57]:
df3_grp=df3.groupby('User ID').agg({'Salary':'sum'})
df3_grp.head()

          Salary
User ID
15566689   57000
15569641   95000
15570769   80000
15570932  115000
15571059   41000

In [59]:
df3_grp=df3.groupby('User ID').agg({'Salary':'count'})
df3_grp.head()

          Salary
User ID
15566689       1
15569641       1
15570769       1
15570932       1
15571059       1

In [61]:
df3_grp=df3.groupby('User ID').agg({'Salary':'mean'})
df3_grp.head()

            Salary
User ID
15566689   57000.0
15569641   95000.0
15570769   80000.0
15570932  115000.0
15571059   41000.0